# DocumentSavingAsEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSavingAsEventArgs Class
Members See Also
---
The event arguments used by the DocumentSavingAs event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class DocumentSavingAsEventArgs : RevitAPIPreDocEventArgs
```

Visual Basic
---
```text
Public Class DocumentSavingAsEventArgs _
	Inherits RevitAPIPreDocEventArgs
```

Visual C++
---
```text
public ref class DocumentSavingAsEventArgs : public RevitAPIPreDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreDocEventArgs Autodesk.Revit.DB.Events..::..DocumentSavingAsEventArgs
# See Also
DocumentSavingAsEventArgs Members
Autodesk.Revit.DB.Events Namespace